In [58]:
import pandas as pd
import numpy as np

In [23]:
df = pd.read_csv('sample_data.csv')

In [10]:
df.head()

         date  sale
0   5/02/2018    30
1   8/01/2018   350
2   4/02/2019   360
3  16/12/2019   420
4  19/02/2018    20

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    26 non-null     object
 1   sale    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [12]:
df = pd.read_csv('sample_data.csv', parse_dates=['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    26 non-null     datetime64[ns]
 1   sale    26 non-null     int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 544.0 bytes

In [13]:
df.head()

        date  sale
0 2018-05-02    30
1 2018-08-01   350
2 2019-04-02   360
3 2019-12-16   420
4 2018-02-19    20

In [14]:
# Read normally
df = pd.read_csv('sample_data.csv')
df.head()

         date  sale
0   5/02/2018    30
1   8/01/2018   350
2   4/02/2019   360
3  16/12/2019   420
4  19/02/2018    20

In [16]:
df.date = pd.to_datetime(df.date, format = "%d/%m/%Y")
df.head()

        date  sale
0 2018-02-05    30
1 2018-01-08   350
2 2019-02-04   360
3 2019-12-16   420
4 2018-02-19    20

In [28]:
df = pd.read_csv('sample_data.csv', parse_dates=['date'], dayfirst=True)
df.head()

        date  sale
0 2018-02-05    30
1 2018-01-08   350
2 2019-02-04   360
3 2019-12-16   420
4 2018-02-19    20

In [31]:
df = df.set_index(['date'])
df.head()

            sale
date
2018-02-05    30
2018-01-08   350
2019-02-04   360
2019-12-16   420
2018-02-19    20

In [20]:
df.loc['2019-02-04':'2019-04-04']

            sale
date
2019-02-04   360
2019-02-25    20
2019-03-11    80
2019-04-01   100
2019-02-18   200
2019-02-25   300

In [21]:
df.loc[df.index < '03-05-2019']

            sale
date
2018-02-05    30
2018-01-08   350
2019-02-04   360
2018-02-19    20
2018-03-12    30
2019-02-25    20
2018-03-05    50
2018-03-05   150
2018-02-26    10
2018-02-26   150
2018-03-26    50
2019-02-18   200
2018-02-19   100
2018-03-26   100
2019-02-25   300
2018-02-12    70

In [37]:
df.loc['2019'].sum()

sale    1550
dtype: int64

In [ ]:
df = pd.read_csv('sample_data.csv', parse_dates= {"date" : ["year","month","day"]}, keep_date_col=True)

In [25]:
df['year']= df['date'].dt.year
df['month']= df['date'].dt.month
df['day']= df['date'].dt.day

In [26]:
df.head()

        date  sale  year  month  day
0 2018-02-05    30  2018      2    5
1 2018-01-08   350  2018      1    8
2 2019-02-04   360  2019      2    4
3 2019-12-16   420  2019     12   16
4 2018-02-19    20  2018      2   19

In [27]:
pd.to_datetime('today')

Timestamp('2021-06-27 13:14:12.264326')

In [29]:
df.head()

        date  sale
0 2018-02-05    30
1 2018-01-08   350
2 2019-02-04   360
3 2019-12-16   420
4 2018-02-19    20

In [38]:
df.head()

            sale
date
2018-02-05    30
2018-01-08   350
2019-02-04   360
2019-12-16   420
2018-02-19    20

In [40]:
df.sort_index()

            sale
date
2018-01-08   350
2018-02-05    30
2018-02-12    70
2018-02-19    20
2018-02-19   100
2018-02-26    10
2018-02-26   150
2018-03-05    50
2018-03-05   150
2018-03-12    30
2018-03-26   100
2018-03-26    50
2019-02-04   360
2019-02-18   200
2019-02-25   300
2019-02-25    20
2019-03-11    80
2019-04-01   100
2019-04-15    30
2019-04-15    40
2019-12-16   420
2020-02-10    40
2020-03-02   300
2020-03-02    40
2020-03-09    50
2020-04-06    60

In [44]:
pd.date_range(start='1/1/2019', end='2/01/2019')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
               '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
               '2019-01-29', '2019-01-30', '2019-01-31', '2019-02-01'],
              dtype='datetime64[ns]', freq='D')

In [46]:
pd.date_range(start='1/1/2019', end='2/01/2019', freq='W')

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27'], dtype='datetime64[ns]', freq='W-SUN')

In [50]:
pd.to_datetime('2019-04-01') + pd.DateOffset(weeks=2)

Timestamp('2019-04-15 00:00:00')

In [52]:
df_temp = df.iloc[:5]
df_temp

            sale
date
2018-02-05    30
2018-01-08   350
2019-02-04   360
2019-12-16   420
2018-02-19    20

In [53]:
df_temp.shift(2, freq="w")

            sale
date
2018-02-18    30
2018-01-21   350
2019-02-17   360
2019-12-29   420
2018-03-04    20

In [76]:
range = pd.date_range("1/1/2019", periods=28, freq="D")

df = pd.Series(np.random.randint(0, 500, len(range)), index=range)

In [77]:
df.head()

2019-01-01    211
2019-01-02    360
2019-01-03     59
2019-01-04    297
2019-01-05    368
Freq: D, dtype: int64

In [68]:
df.resample('W').sum()

2019-01-06    1039
2019-01-13    2079
2019-01-20    1463
2019-01-27    2373
2019-02-03     467
Freq: W-SUN, dtype: int64

In [69]:
df.resample('W-MON').sum()

2019-01-07    1459
2019-01-14    1971
2019-01-21    1426
2019-01-28    2565
Freq: W-MON, dtype: int64

In [72]:
df.resample('W-TUE').sum()

2019-01-01     106
2019-01-08    1727
2019-01-15    2090
2019-01-22    1424
2019-01-29    2074
Freq: W-TUE, dtype: int64

In [110]:
range = pd.date_range("1/4/2019", "4/1/2019", freq="W")

df = pd.Series(np.random.randint(0, 500, len(range)), index=range)

In [111]:
df

2019-01-06    345
2019-01-13    345
2019-01-20    229
2019-01-27     17
2019-02-03    437
2019-02-10    164
2019-02-17     66
2019-02-24    162
2019-03-03    416
2019-03-10    440
2019-03-17    354
2019-03-24    172
2019-03-31     81
Freq: W-SUN, dtype: int64

In [112]:
df = df.to_frame()

In [113]:
df.head()

              0
2019-01-06  345
2019-01-13  345
2019-01-20  229
2019-01-27   17
2019-02-03  437

In [114]:
df = df.drop(index=[pd.to_datetime('2019-03-03'), pd.to_datetime('2019-03-24')])

In [115]:
# check for missing datetimeindex values based on reference index (with all values)
missing_dates = df.index[~df.index.isin(range)]
missing_dates

DatetimeIndex([], dtype='datetime64[ns]', freq=None)

In [116]:
range

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27',
               '2019-02-03', '2019-02-10', '2019-02-17', '2019-02-24',
               '2019-03-03', '2019-03-10', '2019-03-17', '2019-03-24',
               '2019-03-31'],
              dtype='datetime64[ns]', freq='W-SUN')

In [117]:
df.index.get_loc(pd.to_datetime('2019-03-03'), method="nearest")

8

In [118]:
didx = df.index[df.index.get_loc(pd.to_datetime('2019-03-03'), method='nearest')]
didx

Timestamp('2019-03-10 00:00:00')